notes-weather-backend/app/controllers/api/notes_controller.rb

  def create
    @note = current_user.notes.build(notes_params)
    if !@note.title.blank? && !@note.note_description.blank?
      if @note.save
---
INSERT INTO "notes" ("title", "note_description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def renderize_json(myparams)
    notes = set_note_with_pagination(myparams)
    while notes.length < 1 && current_user.notes.where(status: "active").count > 1
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."status" = $2 ORDER BY "notes"."updated_at" DESC LIMIT $3 OFFSET $4  [["user_id", 1], ["status", "Active"], ["LIMIT", 30], ["OFFSET", 0]]

  def set_note_with_pagination(myparams)
    return current_user.notes.where(status: "Active").order(updated_at: :DESC).paginate(myparams)
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."status" = $2 ORDER BY "notes"."updated_at" DESC LIMIT $3 OFFSET $4  [["user_id", 1], ["status", "Active"], ["LIMIT", 30], ["OFFSET", 0]]