notes-weather-backend/app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def revoke_token(token)
      # Decode JWT to get jti and exp values.
      begin
        secret = Rails.application.credentials.jwt_secret
        jti = JWT.decode(token, secret, true, algorithm: 'HS256', verify_jti: true)[0]['jti']
        exp = JWT.decode(token, secret, true, algorithm: 'HS256')[0]['exp']
        user = User.find(JWT.decode(token, secret, true, algorithm: 'HS256')[0]['sub'])